In [1]:
import pandas as pd

In [2]:
var_a = 10
var_b = 20
var_str = 'Intro to Python'

In [3]:
var_a + var_b

30

In [4]:
var_str

'Intro to Python'

Multiple variables

In [5]:
var_a = var_b = 100

In [6]:
print var_a , var_b

100 100

Operations

In [9]:
int (7.8)

7

In [10]:
int ('7')

7

In [11]:
float(100)

100.0

In [16]:
chr(100)

'd'

In [416]:
ord('m')

109

In [19]:
round(10.867)

11.0

In [22]:
round(5.567, 2)

5.57

In [87]:
x=2
isinstance(x, int)

True

In [24]:
isinstance(2.0, int)

False

In [27]:
isinstance('x', (int, float))

False

In [28]:
cmp(1,1)

0

In [29]:
cmp(1,2)

-1

In [30]:
cmp(2,1)

1

In [31]:
pow(7,2)

49

In [32]:
pow(7,2,10)

9

In [33]:
range(10)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [35]:
range(1 ,8)

[1, 2, 3, 4, 5, 6, 7]

In [40]:
range(-1,-8,-1)

[-1, -2, -3, -4, -5, -6, -7]

In [41]:
print 'This is Intro to Python'

This is Intro to Python

In [42]:
string1 = 'This is my first excercise'
string2 = 'Intro to Python and Pandas'
print string1 + ' ' + string2

This is my first excercise Intro to Python and Pandas

In [118]:
print 'My excercise is %s' %string2
print 'Int value %d %d' %(18 , 100)

My excercise is Intro to Python and Pandas
Int value 18 100

Lists

In [47]:
employees = ['Nick', 'Stephen' , 'Frank' , 'Indira']

In [48]:
len(employees)

4

In [49]:
max(employees)

'Stephen'

In [50]:
min(employees)

'Frank'

In [51]:
'Stephen' in employees

True

In [52]:
'aaz' in employees

False

In [54]:
max(employees, key = len)

'Stephen'

In [55]:
min(employees , key = len)

'Nick'

In [56]:
list('Juptyer')

['J', 'u', 'p', 't', 'y', 'e', 'r']

In [57]:
num_list= [-1 , 2, 10, 20]

In [58]:
num_list

[-1, 2, 10, 20]

In [59]:
num_list.append(30)

In [61]:
num_list2= [8,16,24]

In [62]:
num_list.append(num_list2)

In [63]:
num_list

[-1, 2, 10, 20, 30, [8, 16, 24]]

In [65]:
num_list3 = [1,2,3]

In [66]:
num_list.extend (num_list3)

In [67]:
num_list

[-1, 2, 10, 20, 30, [8, 16, 24], 1, 2, 3]

In [73]:
num_list.index([8,16,24])

5

In [75]:
len(num_list)

9

In [81]:
num_list.insert(len(num_list) , 1000
               )

In [77]:
num_list

[-1, 2, 10, 20, 30, [8, 16, 24], 1, 2, 3, 1000]

In [82]:
num_list.pop()

1000

In [85]:
num_list.remove(2)

In [86]:
num_list

[-1, 10, 20, 30, [8, 16, 24], 1, 2, 3]

In [88]:
del num_list[4]

In [89]:
num_list

[-1, 10, 20, 30, 1, 2, 3]

In [90]:
num_list.reverse()

In [91]:
num_list

[3, 2, 1, 30, 20, 10, -1]

In [92]:
num_list.sort()

In [93]:
num_list

[-1, 1, 2, 3, 10, 20, 30]

In [96]:
num_list.sort(reverse = True)

In [97]:
num_list

[30, 20, 10, 3, 2, 1, -1]

In [98]:
employees.sort()

In [99]:
employees

['Frank', 'Indira', 'Nick', 'Stephen']

In [101]:
employees.sort(reverse = True)

In [102]:
employees

['Stephen', 'Nick', 'Indira', 'Frank']

In [103]:
num_list_copy = num_list[:]

In [104]:
num_list_copy

[30, 20, 10, 3, 2, 1, -1]

In [105]:
num_list.pop(0)

30

In [106]:
num_list

[20, 10, 3, 2, 1, -1]

In [107]:
num_list_copy

[30, 20, 10, 3, 2, 1, -1]

Tuples

In [108]:
tup_1 = tuple()

In [109]:
type(tup_1)

tuple

In [111]:
tup_2 = (27,)

In [112]:
type(tup_2)

tuple

In [113]:
tup_3 = ([10,20,30,'ABC'])

In [114]:
tup_3

[10, 20, 30, 'ABC']

In [115]:
tup_3.index(30)

2

In [116]:
tup_3[1:5]

[20, 30, 'ABC']

In [121]:
tup_4= tuple('Introduction')

In [122]:
tup_4.count('o')

2

In [124]:
tup_4.index('o')

4

Sets

In [131]:
set1 = set([10.5,100,20])

In [139]:
set2 = set([10.5,20])

In [140]:
set1.union(set2)

{10.5, 20, 100}

In [141]:
set1.difference(set2)

{100}

In [142]:
set1.symmetric_difference(set2)

{100}

In [143]:
set1.isdisjoint(set2)

False

In [145]:
set1.issubset(set2)

False

In [146]:
set1.issuperset(set2)

True

In [147]:
set1.intersection(set2)

{10.5, 20}

In [148]:
set1.pop()

10.5

In [149]:
set1.add(10.5)

In [150]:
set1

{10.5, 20, 100}

In [152]:
set1.remove(20)

In [153]:
set1

{10.5, 100}

In [154]:
set1.clear()

In [155]:
set1

set()

Condition flow

In [167]:
numbers_palindrom = ['53235' , '12345' , '89098' , '4444']

for i in range(0,len(numbers_palindrom)):
    if numbers_palindrom[i] == numbers_palindrom[i][::-1]:
        print numbers_palindrom[i] + ' is palindrome'
    else:
        print numbers_palindrom[i] + ' is not palindrome'

53235 is palindrome
12345 is not palindrome
89098 is palindrome
4444 is palindrome

In [186]:
numbers_lst = [1,-1,30,20,5,9,100]
length_lst = len(numbers_lst)
i = 0
while(length_lst > 0):
    if(numbers_lst[i] % 2 == 1):
        print str(numbers_lst[i]) + ' is prime'
    else:
        print str(numbers_lst[i]) + ' is not prime'
    
    if(length_lst == 5):
        break
    else:
        length_lst += -1
        i +=1

1 is prime
-1 is prime
30 is not prime

In [200]:
[10*z for i in range(100) if i==10 for z in range(1,15)]

[10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140]


create dataframe

In [201]:
import datetime as dt

In [207]:
dateStart = dt.datetime(2017,1,1)
dateEnd = dt.datetime(2017,11,16)
diff = dt.timedelta(days =31)
date_calc =[]

In [208]:
while dateEnd > dateStart:
    date_calc.append(dateStart.strftime('%y-%m')) 
    dateStart += diff

In [209]:
date_calc

['17-01',
 '17-02',
 '17-03',
 '17-04',
 '17-05',
 '17-06',
 '17-07',
 '17-08',
 '17-09',
 '17-10',
 '17-11']

In [211]:
dframe = pd.DataFrame()

dictionary = {'#Date': date_calc , 'HR':[20,21,25,36,15,12,34,34,10,23,10] , 'Finance':[30,11,25,16,17,18,34,34,10,23,10]}

In [213]:
dictionary

{'#Date': ['17-01',
  '17-02',
  '17-03',
  '17-04',
  '17-05',
  '17-06',
  '17-07',
  '17-08',
  '17-09',
  '17-10',
  '17-11'],
 'Finance': [30, 11, 25, 16, 17, 18, 34, 34, 10, 23, 10],
 'HR': [20, 21, 25, 36, 15, 12, 34, 34, 10, 23, 10]}

In [216]:
dframe= pd.DataFrame(dictionary)

In [217]:
dframe

    #Date  Finance  HR
0   17-01       30  20
1   17-02       11  21
2   17-03       25  25
3   17-04       16  36
4   17-05       17  15
5   17-06       18  12
6   17-07       34  34
7   17-08       34  34
8   17-09       10  10
9   17-10       23  23
10  17-11       10  10

In [219]:
dframe.set_index('#Date')

       Finance  HR
#Date
17-01       30  20
17-02       11  21
17-03       25  25
17-04       16  36
17-05       17  15
17-06       18  12
17-07       34  34
17-08       34  34
17-09       10  10
17-10       23  23
17-11       10  10

In [223]:
vehicle = pd.read_csv('./data/vehicles_test.csv')

In [224]:
vehicle

   price  year   miles  doors   type
0   3000  2003  130000      4  truck
1   6000  2005   82500      4    car
2  12000  2010   60000      2    car

In [226]:
vehicle.doors.value_counts()

4    2
2    1
Name: doors, dtype: int64

In [227]:
vehicle.head()

   price  year   miles  doors   type
0   3000  2003  130000      4  truck
1   6000  2005   82500      4    car
2  12000  2010   60000      2    car

Series

In [228]:
my_series = pd.Series([1,2,3,'String'])

In [229]:
my_series

0         1
1         2
2         3
3    String
dtype: object

In [231]:
index = ['a' , 'b' , 'c' , 'd']

In [233]:
my_series.index = index

In [234]:
my_series

a         1
b         2
c         3
d    String
dtype: object

In [237]:
my_series1= pd.Series({'London':10, 'Newyork': 20 , 'NewDelhi':30})

In [238]:
my_series1

London      10
NewDelhi    30
Newyork     20
dtype: int64

In [240]:
my_series1[my_series1==20]

Newyork    20
dtype: int64

In [241]:
index2 = ['London', 'Newyork', 'Chennai']

In [242]:
my_series2 =  pd.Series({'London':10, 'Newyork': 20 , 'NewDelhi':30})

In [244]:
my_series2.index = index2

In [245]:
my_series2

London     10
Newyork    30
Chennai    20
dtype: int64

In [246]:
my_series1 + my_series2

Chennai      NaN
London      20.0
NewDelhi     NaN
Newyork     50.0
dtype: float64

In [247]:
my_series1.isnull()

London      False
NewDelhi    False
Newyork     False
dtype: bool

In [248]:
my_series2.notnull()

London     True
Newyork    True
Chennai    True
dtype: bool

In [296]:
data = {'City': ['Newyork', 'Chennai', 'Mumbai', 'Delhi'],
        'year': [2000, 2000, 2000, 2000 ],
        'pollution': [1.5, 1.7, 3.6, 2.4]}

In [253]:
data

{'City': ['Newyork', 'Chennai', 'Mumbai', 'Delhi'],
 'pollution': [1.5, 1.7, 3.6, 2.4],
 'year': [2000, 2000, 2000, 2000]}

In [343]:
dframe1= pd.DataFrame(data , columns=['City', 'year', 'pollution', 'IncreaseInPerc'])

In [344]:
dframe1.index = ['One', 'Two', 'Three', 'Four']

In [345]:
dframe1

          City  year  pollution IncreaseInPerc
One    Newyork  2000        1.5            NaN
Two    Chennai  2000        1.7            NaN
Three   Mumbai  2000        3.6            NaN
Four     Delhi  2000        2.4            NaN

    To access the row in dataframe

In [317]:
dframe1.loc['Two']

City              Chennai
year                 2000
pollution             1.7
IncreaseInPerc        NaN
Name: Two, dtype: object

To access the column in dataframe

In [318]:
dframe1['City']

One      Newyork
Two      Chennai
Three     Mumbai
Four       Delhi
Name: City, dtype: object

In [273]:
import numpy as  np

In [275]:
np.arange(1,3,0.6)

array([ 1. ,  1.6,  2.2,  2.8])

In [346]:
dframe1['IncreaseInPerc'] = np.arange(1,3,0.6)

In [347]:
dframe1

          City  year  pollution  IncreaseInPerc
One    Newyork  2000        1.5             1.0
Two    Chennai  2000        1.7             1.6
Three   Mumbai  2000        3.6             2.2
Four     Delhi  2000        2.4             2.8

In [348]:
dframe1['HiglyPolluted']= dframe1.IncreaseInPerc > 2.0

In [349]:
dframe1

          City  year  pollution  IncreaseInPerc  HiglyPolluted
One    Newyork  2000        1.5             1.0          False
Two    Chennai  2000        1.7             1.6          False
Three   Mumbai  2000        3.6             2.2           True
Four     Delhi  2000        2.4             2.8           True

In [350]:
del dframe1['HiglyPolluted']

In [351]:
dframe1

          City  year  pollution  IncreaseInPerc
One    Newyork  2000        1.5             1.0
Two    Chennai  2000        1.7             1.6
Three   Mumbai  2000        3.6             2.2
Four     Delhi  2000        2.4             2.8

In [331]:
dframe1.T

                    One      Two   Three   Four
City            Newyork  Chennai  Mumbai  Delhi
year               2000     2000    2000   2000
pollution           1.5      1.7     3.6    2.4
IncreaseInPerc        1      1.6     2.2    2.8

In [352]:
dframe1.index.name ='PollData'

In [353]:
dframe1

             City  year  pollution  IncreaseInPerc
PollData
One       Newyork  2000        1.5             1.0
Two       Chennai  2000        1.7             1.6
Three      Mumbai  2000        3.6             2.2
Four        Delhi  2000        2.4             2.8

In [354]:
dframe1.columns.name='CityWiseData'

In [355]:
dframe1

CityWiseData     City  year  pollution  IncreaseInPerc
PollData
One           Newyork  2000        1.5             1.0
Two           Chennai  2000        1.7             1.6
Three          Mumbai  2000        3.6             2.2
Four            Delhi  2000        2.4             2.8

In [336]:
dframe1.values

array([['Newyork', 2000, 1.5, 1.0],
       ['Chennai', 2000, 1.7, 1.6],
       ['Mumbai', 2000, 3.6, 2.2],
       ['Delhi', 2000, 2.4, 2.8000000000000003]], dtype=object)

In [337]:
dframe1.index

Index([u'One', u'Two', u'Three', u'Four'], dtype='object', name=u'PollData')

In [338]:
'Newyork' in dframe1.values

True

In [339]:
'Two' in dframe1.index

True

In [340]:
'City' in dframe1.columns

True

In [360]:
reindexDF = pd.DataFrame(data , columns=['City', 'year', 'pollution' ])

In [361]:
reindexDF

      City  year  pollution
0  Newyork  2000        1.5
1  Chennai  2000        1.7
2   Mumbai  2000        3.6
3    Delhi  2000        2.4

In [362]:
reindexDF.index = ['One','Two','Three','Four']

In [365]:
reindexDF2 = reindexDF.reindex(['One','Two','Three','Four','Five'])

In [366]:
reindexDF2

          City    year  pollution
One    Newyork  2000.0        1.5
Two    Chennai  2000.0        1.7
Three   Mumbai  2000.0        3.6
Four     Delhi  2000.0        2.4
Five       NaN     NaN        NaN

In [367]:
obj3 = pd.Series(['Circle', 'Triangle', 'Square'], index=[0, 2, 4])

In [368]:
obj3

0      Circle
2    Triangle
4      Square
dtype: object

In [373]:
obj3.reindex(range(6), method='ffill')

0      Circle
1      Circle
2    Triangle
3    Triangle
4      Square
5      Square
dtype: object

In [378]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)) ,index = [0,2,4] , columns=['Newyork','Chennai','Delhi'])

In [380]:
up_frame = frame.reindex ([0,2,4,6])

In [381]:
up_frame

   Newyork  Chennai  Delhi
0      0.0      1.0    2.0
2      3.0      4.0    5.0
4      6.0      7.0    8.0
6      NaN      NaN    NaN

In [399]:
drop_exmaple = pd.DataFrame(np.arange(16).reshape(4,4) , index=['S01','S02','S03','S04'] , columns =['Newyork', 'Chennai', 'Delhi', 'Mumbai'])

In [400]:
drop_exmaple

     Newyork  Chennai  Delhi  Mumbai
S01        0        1      2       3
S02        4        5      6       7
S03        8        9     10      11
S04       12       13     14      15

In [404]:
drop_exmaple.drop(['S01'])

     Newyork  Chennai  Delhi  Mumbai
S02        4        5      6       7
S03        8        9     10      11
S04       12       13     14      15

In [406]:
drop_exmaple.drop(['S01','S03'])

     Newyork  Chennai  Delhi  Mumbai
S02        4        5      6       7
S04       12       13     14      15

In [410]:
drop_exmaple.drop(['Newyork'], axis=1 , inplace=True)

In [411]:
drop_exmaple

     Chennai  Delhi  Mumbai
S01        1      2       3
S02        5      6       7
S03        9     10      11
S04       13     14      15

In [412]:
drop_exmaple.describe()

         Chennai      Delhi     Mumbai
count   4.000000   4.000000   4.000000
mean    7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978
min     1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000
50%     7.000000   8.000000   9.000000
75%    10.000000  11.000000  12.000000
max    13.000000  14.000000  15.000000

In [422]:
drop_exmaple.iloc[0]

Chennai    1
Delhi      2
Mumbai     3
Name: S01, dtype: int64

In [423]:
drop_exmaple.loc['S01']

Chennai    1
Delhi      2
Mumbai     3
Name: S01, dtype: int64

In [427]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(9).reshape(3,3) , columns = list('abc'),
                  index =['Ohio', 'Texas', 'Colorado'])

In [429]:
df1 + df2

           a     b     c   d
Ohio     NaN   1.0   3.0 NaN
Texas    NaN   7.0   9.0 NaN
Colorado NaN  13.0  15.0 NaN

In [430]:
df1-df2

           a    b    c   d
Ohio     NaN -1.0 -1.0 NaN
Texas    NaN -1.0 -1.0 NaN
Colorado NaN -1.0 -1.0 NaN

In [445]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)) ,  
                   columns=list('abcde'))

In [446]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [447]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [443]:
df2.iloc[0,0]

0.0

In [448]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [451]:
df1.add (df2 , fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [452]:
df1.reindex (columns=df2.columns , fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [453]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('ABC'),
                     index=['r1', 'r2', 'r3', 'r4'])

In [454]:
frame

           A         B         C
r1 -0.276297 -0.236234  0.637601
r2 -0.186875 -0.957085 -1.465080
r3  0.351971 -1.101891  0.835019
r4  0.922457 -1.623066 -0.227545

In [455]:
np.abs(frame)

           A         B         C
r1  0.276297  0.236234  0.637601
r2  0.186875  0.957085  1.465080
r3  0.351971  1.101891  0.835019
r4  0.922457  1.623066  0.227545

In [456]:
frame

           A         B         C
r1 -0.276297 -0.236234  0.637601
r2 -0.186875 -0.957085 -1.465080
r3  0.351971 -1.101891  0.835019
r4  0.922457 -1.623066 -0.227545

In [458]:
f = lambda x: x.max() - x.min()
frame.apply(f)

frame.max()

A    0.922457
B   -0.236234
C    0.835019
dtype: float64

In [461]:
frame.max(axis=1)

r1    0.637601
r2   -0.186875
r3    0.835019
r4    0.922457
dtype: float64